[
  { "input": "The Vendor shall indemnify and hold harmless the Client from all claims, damages, losses, costs, and expenses arising from any breach of this Agreement by the Vendor.", "output": "indemnification" },
  { "input": "Seller agrees to defend, indemnify, and hold harmless Buyer and its officers, directors, and employees against any and all third-party claims.", "output": "indemnification" },
  { "input": "The Service Provider shall indemnify the Company against all liabilities, costs, expenses, damages, and losses suffered or incurred by the Company arising out of or in connection with any claim made against the Company by a third party.", "output": "indemnification" },
  { "input": "Contractor shall hold harmless and indemnify Client from any claims, suits, or proceedings brought by any third party resulting from Contractor's negligence or willful misconduct.", "output": "indemnification" },
  { "input": "The indemnifying party shall reimburse the indemnified party for all reasonable attorneys' fees and costs incurred in the defense of any such claim.", "output": "indemnification" },
  { "input": "Each party shall indemnify the other against any loss or damage arising from any breach of the representations and warranties set forth in this Agreement.", "output": "indemnification" },
  { "input": "Supplier shall defend and hold harmless Purchaser from and against all damages, claims, and expenses, including reasonable legal fees, arising from defects in the delivered goods.", "output": "indemnification" },
  { "input": "The Licensee shall indemnify the Licensor against all costs, claims, and damages arising from the Licensee's unauthorized use of the licensed materials.", "output": "indemnification" },
  { "input": "Consultant agrees to indemnify and hold harmless the Company from any liability arising out of Consultant's performance of services under this Agreement.", "output": "indemnification" },
  { "input": "The Publisher shall indemnify the Author against any damages finally awarded in any suit based on a claim that the Work infringes any third-party intellectual property rights.", "output": "indemnification" },
  { "input": "For a period of twenty-four months after the closing date, the Seller shall not directly or indirectly own, manage, operate, or control any business that competes with the Business in the Territory.", "output": "non-compete" },
  { "input": "During the term of this Agreement and for twelve months thereafter, Employee shall not engage in any business activity that is competitive with the Company's business within a fifty-mile radius.", "output": "non-compete" },
  { "input": "The Founder agrees not to compete with the Company for a period of two years following termination of employment, within any market in which the Company operates.", "output": "non-compete" },
  { "input": "For three years after the effective date, neither party shall solicit or hire any employee of the other party or engage in any competing business activity.", "output": "non-compete" },
  { "input": "Seller covenants that for eighteen months following the closing, Seller will not directly or indirectly engage in any business substantially similar to the Business anywhere in the United States.", "output": "non-compete" },
  { "input": "The Consultant agrees that during the term and for one year after expiration, Consultant will not provide similar consulting services to any direct competitor of the Company.", "output": "non-compete" },
  { "input": "Executive shall not, for a period of twenty-four months after separation, own any interest in, manage, control, participate in, or be employed by any entity engaged in a competing business.", "output": "non-compete" },
  { "input": "The Franchisee agrees not to operate or have any interest in a similar business within ten miles of any franchise location for two years after termination.", "output": "non-compete" },
  { "input": "Partner agrees that for thirty-six months following departure from the Partnership, Partner shall not establish, operate, or work for any competing enterprise in the same metropolitan area.", "output": "non-compete" },
  { "input": "The Acquiring Party shall not compete with the Seller's remaining business operations for a period of five years in any geographic region where the Seller currently conducts business.", "output": "non-compete" },
  { "input": "Either party may terminate this Agreement at any time for any reason or no reason by providing ninety days prior written notice to the other party.", "output": "termination-for-convenience" },
  { "input": "The Client may terminate this Agreement for convenience upon thirty days written notice to the Contractor, without cause and without penalty.", "output": "termination-for-convenience" },
  { "input": "Notwithstanding any other provision of this Agreement, either party may terminate this Agreement at will by giving sixty days advance written notice.", "output": "termination-for-convenience" },
  { "input": "The Government reserves the right to terminate this contract in whole or in part for its convenience. The Contracting Officer shall give written notice of termination.", "output": "termination-for-convenience" },
  { "input": "This Agreement may be terminated by either party without cause, effective upon delivery of written notice at least forty-five days prior to the desired termination date.", "output": "termination-for-convenience" },
  { "input": "Customer may cancel this subscription at any time by providing written notice. Cancellation will take effect at the end of the current billing period.", "output": "termination-for-convenience" },
  { "input": "The Board of Directors may terminate the Executive's employment at any time without cause, subject to the severance provisions described in Section 8.", "output": "termination-for-convenience" },
  { "input": "Either party shall have the right to terminate this Agreement for convenience upon providing the other party with not less than ninety calendar days prior written notice.", "output": "termination-for-convenience" },
  { "input": "The University may terminate this research agreement for convenience at any time upon thirty days written notice to the Principal Investigator.", "output": "termination-for-convenience" },
  { "input": "This service agreement may be terminated by either party for any reason upon sixty days written notice, provided all outstanding invoices are settled.", "output": "termination-for-convenience" },
  { "input": "In no event shall either party be liable to the other for any indirect, incidental, special, consequential, or punitive damages, regardless of the cause of action or the theory of liability.", "output": "limitation-of-liability" },
  { "input": "The total aggregate liability of the Provider under this Agreement shall not exceed the total fees paid by the Customer during the twelve-month period preceding the claim.", "output": "limitation-of-liability" },
  { "input": "Neither party shall be liable to the other for lost profits, lost revenue, or loss of business opportunity, even if advised of the possibility of such damages.", "output": "limitation-of-liability" },
  { "input": "Notwithstanding anything to the contrary, the Vendor's maximum liability for all claims arising under this Agreement shall not exceed the contract value.", "output": "limitation-of-liability" },
  { "input": "Under no circumstances shall either party's total liability exceed the amount of fees actually paid under this Agreement in the six months prior to the event giving rise to the claim.", "output": "limitation-of-liability" },
  { "input": "The Supplier's liability under this Agreement shall be limited to direct damages and shall in no event exceed the purchase price of the defective goods.", "output": "limitation-of-liability" },
  { "input": "IN NO EVENT SHALL THE LICENSOR BE LIABLE FOR ANY SPECIAL, INCIDENTAL, INDIRECT, OR CONSEQUENTIAL DAMAGES WHATSOEVER ARISING OUT OF THE USE OF OR INABILITY TO USE THE SOFTWARE.", "output": "limitation-of-liability" },
  { "input": "The maximum liability of the Consultant for any and all claims related to this engagement shall not exceed the total professional fees received by the Consultant.", "output": "limitation-of-liability" },
  { "input": "Except for breaches of confidentiality obligations, neither party's liability shall exceed two times the annual fees paid or payable under this Agreement.", "output": "limitation-of-liability" },
  { "input": "The Service Provider disclaims all liability for indirect, special, or consequential damages, and total liability shall be capped at the amount paid in the preceding twelve months.", "output": "limitation-of-liability" },
  { "input": "In the event of a Change of Control of the Company, all unvested stock options shall immediately vest and become exercisable.", "output": "change-of-control" },
  { "input": "If a Change of Control occurs, the Employee shall be entitled to a lump-sum severance payment equal to two times the Employee's annual base salary.", "output": "change-of-control" },
  { "input": "This Agreement shall not be assigned by either party without prior written consent, except that either party may assign this Agreement in connection with a merger, acquisition, or sale of substantially all of its assets.", "output": "change-of-control" },
  { "input": "Upon a Change of Control, the acquiring entity shall assume all obligations under this Agreement, and the other party shall have the right to terminate upon sixty days notice.", "output": "change-of-control" },
  { "input": "In the event that more than fifty percent of the voting shares of the Company are acquired by a third party, the Licensee shall have the right to terminate this License Agreement.", "output": "change-of-control" },
  { "input": "A Change of Control shall mean any transaction resulting in a person or group acquiring beneficial ownership of more than fifty percent of the outstanding voting securities of the Company.", "output": "change-of-control" },
  { "input": "If a Change of Control event occurs during the term, the non-acquired party may elect to terminate this Agreement within ninety days of receiving notice of such change.", "output": "change-of-control" },
  { "input": "Executive shall receive a retention bonus equal to one year's salary if Executive remains employed for twelve months following a Change of Control of the Company.", "output": "change-of-control" },
  { "input": "Upon consummation of a Change of Control, all performance-based restricted stock units shall vest at target level and be settled within thirty days.", "output": "change-of-control" },
  { "input": "The joint venture agreement shall terminate automatically upon a Change of Control of either partner, unless the remaining partner consents in writing to continuation.", "output": "change-of-control" }
]
